[
  "Urban Traffic Prediction from Spatio-Temporal Data  Using Deep Meta Learning",
  "Efficient Similar Region Search with Deep Metric Learning",
  "On Prediction of User Destination by Sub-Trajectory Understanding",
  "Exploiting Spatio-Temporal Correlations with Multiple 3D Convolutional Neural Networks for Citywide Vehicle Flow Prediction",
  "Network-wide Crowd Flow Prediction of Sydney Trains via Customized Online Non-negative Matrix Factorization",
  "Enhancing transportation systems via deep learning_ A survey",
  "Learning from Multiple Cities: A Meta-Learning Approach for Spatial-Temporal Prediction",
  "Machine Learning for Spatiotemporal Sequence Forecasting: A Survey",
  "Non-locally Enhanced Encoder-Decoder Network for Single Image De-raining",
  "DeepMove",
  "Cross-City Transfer Learning for Deep Spatio-Temporal Prediction",
  "Using GANs for Generation of Realistic City-Scale Ride Sharing/Hailing Data Sets",
  "Detecting Vehicle Illegal Parking Events using Sharing Bikes' Trajectories.",
  "Multistep Speed Prediction on Traffic Networks - A Graph Convolutional Sequence-to-Sequence Learning Approach with Attention Mechanism.",
  "Spatiotemporal Multi-Graph Convolution Network for Ride-hailing Demand Forecasting",
  "Revisiting Spatial-Temporal Similarity: A Deep Learning Framework for Traffic Prediction",
  "Hexagon-Based Convolutional Neural Network for Supply-Demand Forecasting of Ride-Sourcing Services",
  "Multi-task representation learning for travel time estimation",
  "Graph Attention Networks.",
  "Predicting citywide crowd flows using deep spatio-temporal residual networks",
  "STANN - A Spatio-Temporal Attentive Neural Network for Traffic Prediction.",
  "Spatio-Temporal Graph Convolutional Networks - A Deep Learning Framework for Traffic Forecasting.",
  "HyperST-Net - Hypernetworks for Spatio-Temporal Forecasting.",
  "UrbanFM: Inferring Fine-Grained Urban Flows",
  "Grids versus Graphs: Partitioning Space for Improved Taxi Demand-Supply Forecasts",
  "Learning from Multiple Cities: A Meta-Learning Approach for Spatial-Temporal Prediction",
  "Survey of neural network-based models for short-term traffic state prediction",
  "High-Order Graph Convolutional Recurrent Neural Network - A Deep Learning Framework for Network-Scale Traffic Learning and Forecasting.",
  "Spatio-Temporal Graph Convolution for Skeleton Based Action Recognition.",
  "Ensemble-Spotting - Ranking Urban Vibrancy via POI Embedding with Multi-view Spatial Graphs.",
  "Incomplete Label Multi-task Deep Learning for Spatio-temporal Event Subtype Forecasting",
  "Where to Go Next: A Spatio-temporal LSTM model for Next POI Recommendation",
  "Spatiotemporal Multi-Graph Convolution Network for Ride-hailing Demand Forecasting",
  "Attention Based Spatial-Temporal Graph Convolutional Networks for Traffic Flow Forecasting",
  "Traffic Updates: Saying a Lot While Revealing a Little",
  "TraPHic: Trajectory Prediction in Dense and Heterogeneous Traffic Using Weighted Interactions",
  "TrafficPredict - Trajectory Prediction for Heterogeneous Traffic-Agents.",
  "[slides] Urban Computing - Building Intelligent Citiesith Big Data and AI",
  "Forecasting Taxi Demands with Fully Convolutional Networks and Temporal Guided Embedding",
  "Efficient Region Embedding with Multi-view Spatial Networks: A Perspective of Locality-Constrained Spatial Autocorrelations",
  "Learning Urban Community Structures",
  "Incentivized vehicle relocation in vehicle sharing systems",
  "The Bike sharing Rebalancing Problem with Stochastic Demands",
  "Predicting station-level hourly demand in a large-scale bike-sharing network_ A graph convolutional neural network approach",
  "Literature review of the vehicle relocation problem in one-way car sharing networks",
  "Short-term forecasting of passenger demand under on-demand ride services_ A spatio-temporal deep learning approach",
  "Deep learning methods in transportation domain: a review",
  "DeepTransport: Learning Spatial-Temporal Dependency for Traffic Condition Forecasting",
  "Diffusion Convolutional Recurrent Neural Network: Data-Driven Traffic Forecasting",
  "Spatiotemporal Recurrent Convolutional Networks for Traffic Prediction in Transportation Networks",
  "Deep Multi-View Spatial-Temporal Network for Taxi Demand Prediction.",
  "Deep Spatio-Temporal Residual Networks for Citywide Crowd Flows Prediction.",
  "Deep learning for short-term traffic flow prediction",
  "Deep Stacked Bidirectional and Unidirectional LSTM Recurrent Neural Network for Network-wide Traffic Speed Prediction",
  "Short-Term Traffic Prediction: Modelling Temporal-Spatial Features in Local Highway Networks with Deep Neural Networks",
  "Latent Space Model for Road Networks to Predict Time-Varying Traffic",
  "pg-Causality - Identifying Spatiotemporal Causal Pathways for Air Pollutants with Urban Big Data.",
  "A Brief survey on Smart Community and Smart Transportation",
  "Semantic Exploration of Traffic Dynamics",
  "urban data and city dashboards six key issues",
  "Smart Cities: Definitions, Dimensions, Performance, and Initiatives",
  "CityDNA",
  "Understanding Smart Cities: A Tool for Smart Government or an Industrial Trick?",
  "Smart utopia VS smart reality: Learning by experience from 10 smart city cases",
  "Smart Cities and the Internet of Things",
  "Understanding the smart city domain: A literature review",
  "A Unified Smart City Model (USCM) for Smart City Conceptualization and Benchmarking."
]
